Revit 2024 API
FamilyInstancePlacingArgs.IsBanned Property
 Indicates if the cursor is banned or not.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsBanned { get; set; }
Visual Basic
Public Property IsBanned As Boolean
	Get
	Set
Visual C++
public:
property bool IsBanned {
	bool get ();
	void set (bool value);
}
See Also
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace